[
  {
    "name": "encounter_id",
    "type": "STRING",
    "description": "The logical identifier for the encounter.  This is a system-generated ID used internally to track and manage the encounter record. It should be unique within the system.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "lastupdated",
    "type": "TIMESTAMP",
    "description": "The date and time when the encounter record was last updated. This reflects the last modification to the encounter data, not necessarily the clinical encounter itself.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "hl7_message_date_time",
    "type": "DATETIME",
    "description": "The date and time the original HL7 message was created.  This represents the timestamp from the source system sending the encounter information.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "hl7_message_date_time_UTC",
    "type": "DATETIME",
    "description": "The date and time the original HL7 message was created, represented in Coordinated Universal Time (UTC). This ensures consistent time representation across different time zones.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "hl7_message_control_id",
    "type": "STRING",
    "description": "The control ID from the original HL7 message. This ID is used for message tracking and correlation in HL7 messaging.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "meta_latest_source_date_time",
    "type": "DATETIME",
    "description": "The date and time of the latest data update from the source system. This indicates the most recent time the encounter information was modified in the originating system.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "intermediate_snapshot_creation_date_time",
    "type": "DATETIME",
    "description": "The date and time when an intermediate snapshot of the encounter data was created. This is relevant for systems that create snapshots during data processing or transformation.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "final_fhir_write_date_time",
    "type": "DATETIME",
    "description": "The date and time when the encounter data was initially written to the FHIR repository. This marks the first persistence of the encounter data in FHIR format.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "final_fhir_commit_date_time",
    "type": "DATETIME",
    "description": "The date and time when the final FHIR version of the encounter data was committed. This represents the completion of the FHIR data persistence process.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "encounter_version_id",
    "type": "STRING",
    "description": "The version identifier for the encounter record. This allows tracking changes and revisions to the encounter data over time.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "version_id_fingerprint",
    "type": "INTEGER",
    "description": "A numeric fingerprint or hash value generated from the version ID. This can be used for data integrity checks and verification.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "consent_coid",
    "type": "STRING",
    "description": "An identifier related to patient consent. This could refer to a consent directive or authorization for the use of encounter data.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "meta_action_code",
    "type": "STRING",
    "description": "A code indicating the action performed on the encounter data (e.g., create, update, delete). This is used for audit trails and data provenance tracking.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "hl7_v2_source_interface",
    "type": "STRING",
    "description": "Information about the HL7 V2 interface used as the source of the encounter data. This helps identify the originating system and its configuration.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "patient_account_num",
    "type": "STRING",
    "description": "The patient's account number within the healthcare system. This is a unique identifier used for billing and administrative purposes.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "accommodation_code",
    "type": "STRING",
    "description": "Represents a code for the specific type of accommodation provided to the patient during the encounter (e.g., private room, semi-private room, ward).  This is often used for billing and resource tracking.  It should align with standard accommodation codes.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "accommodation_code_category",
    "type": "STRING",
    "description": "Represents a broader category for the accommodation code (e.g., 'private', 'shared').  Provides a higher-level grouping for accommodation types.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "hospital_service_type_code",
    "type": "STRING",
    "description": "Indicates the type of hospital service the patient received (e.g., medical, surgical, maternity).  Used for classifying encounters based on the service provided.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "hospital_service_type_text",
    "type": "STRING",
    "description": "A human-readable description of the hospital service type.  Provides additional context to the coded representation.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "admit_source_code",
    "type": "STRING",
    "description": "Indicates the source of the admission (e.g., physician referral, emergency room, transfer from another facility).  Provides information about how the encounter originated.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "discharge_disposition",
    "type": "RECORD",
    "mode": "REPEATED",
    "fields": [
      {
        "name": "code",
        "type": "STRING",
        "description": "Code for the patient's disposition after discharge (e.g., home, skilled nursing facility, hospice).",
        "PHI/PII": false,
        "HIPAA": true
      },
      {
        "name": "display",
        "type": "STRING",
        "description": "Human-readable description of the discharge disposition code.",
        "PHI/PII": false,
        "HIPAA": true
      }
    ],
    "description": "Information about the patient's destination after the encounter concludes.  Includes a code and human-readable description.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "patient_id",
    "type": "STRING",
    "description": "Unique identifier for the patient associated with the encounter.  Links the encounter to the patient's record.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "appointment_id",
    "type": "STRING",
    "description": "Identifier for the appointment associated with the encounter, if applicable.  Connects the encounter to a scheduled appointment.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "account_id",
    "type": "STRING",
    "description": "Identifier for the account associated with the encounter.  Used for billing and financial tracking.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "deceased_date_time",
    "type": "STRING",
    "description": "Date and time of the patient's death, if applicable.  Records the time of death during or related to the encounter.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "admission_date",
    "type": "STRING",
    "description": "Date and time of the patient's admission to the encounter. Marks the formal start of the encounter.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "discharge_date",
    "type": "STRING",
    "description": "Date and time the patient was discharged from the encounter.  Indicates the official end of the encounter.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "is_valid_date_ind",
    "type": "BOOLEAN",
    "description": "Indicator of whether the date information associated with the encounter is considered valid.  Used for data quality control.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "alt_admission_date_time",
    "type": "STRING",
    "description": "Alternative date and time of admission, if available.  Provides a secondary admission time if needed.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "hl7_admission_date_time",
    "type": "STRING",
    "description": "Admission date and time as represented in HL7 format.  Used for interoperability with HL7 systems.",
    "PHI/PII": false,
    "HIPAA": true
  },
  {
    "name": "patient_primary_id",
    "type": "STRING",
    "description": "The patient's primary identifier.  This is a crucial link to the Patient resource in FHIR.  Ensuring this ID is correct is essential for accurate patient matching and data integration.  Consider using a FHIR-compliant identifier system like UUID or OID.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "network_mnemonic",
    "type": "STRING",
    "description": "Represents the mnemonic or short code for the healthcare network.  This helps identify the specific network within a larger healthcare system or organization.  May be useful for internal reporting and resource allocation.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "medical_record_num",
    "type": "STRING",
    "description": "The patient's medical record number within the specific healthcare system.  This is a key identifier for accessing patient records within the organization.  Important for internal data retrieval and record linkage.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "coid",
    "type": "STRING",
    "description": "Represents the Client Organization ID. This field identifies the organization responsible for the patient's care during the encounter. Useful for tracking encounters across different organizations.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "facility_mnemonic",
    "type": "STRING",
    "description": "The mnemonic or short code for the healthcare facility where the encounter occurred.  Helps identify the specific location within a network or system.  Useful for resource tracking and reporting.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "fhir_visit_status",
    "type": "STRING",
    "description": "Corresponds to the Encounter.status element in FHIR.  Indicates the current status of the encounter (e.g., planned, arrived, in-progress, finished, cancelled).  Essential for tracking encounter progress and workflow management.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "fhir_patient_class_code",
    "type": "STRING",
    "description": "Represents the coded value for the patient's class (e.g., inpatient, outpatient, emergency).  Maps to the Encounter.class element in FHIR.  Important for classifying encounters and reporting.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "fhir_patient_class_display",
    "type": "STRING",
    "description": "The human-readable display value for the patient's class (e.g., \"Inpatient\", \"Outpatient\", \"Emergency\").  Provides a user-friendly representation of the fhir_patient_class_code.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "patient_type",
    "type": "STRING",
    "description": "A more granular classification of the patient type within the encounter (e.g., surgical, medical, observation).  May be used for more detailed reporting and analysis.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "admission_type",
    "type": "STRING",
    "description": "Specifies the type of admission (e.g., emergency, elective, urgent).  Provides further context about the circumstances of the encounter.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "patient_class_code",
    "type": "STRING",
    "description": "Similar to fhir_patient_class_code, but may represent a local coding system.  Ensure mapping to the standard FHIR Encounter.class element for interoperability.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "account_status_code",
    "type": "STRING",
    "description": "Indicates the status of the patient's account related to the encounter (e.g., open, closed, pending).  Primarily used for billing and administrative purposes.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "vip_indicator_code",
    "type": "STRING",
    "description": "Flags whether the patient is considered a VIP.  Used for special handling or accommodations during the encounter.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "financial_class_code",
    "type": "STRING",
    "description": "Represents the patient's financial class (e.g., insurance type, self-pay).  Used for billing and financial reporting.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "mode_of_arrival_code",
    "type": "STRING",
    "description": "Indicates how the patient arrived at the encounter location (e.g., ambulance, walk-in, transfer).  Provides context about the encounter and may be relevant for clinical documentation.",
    "PHI/PII": false,
    "HIPAA": false
  },
  {
    "name": "alt_discharge_date_time",
    "type": "STRING",
    "description": "Alternative representation of the discharge date and time.  May be used if the primary discharge date time is unavailable or in a different format.  Important for data integration and analysis when dealing with various data sources.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "hl7_discharge_date_time",
    "type": "STRING",
    "description": "Discharge date and time as received in an HL7 message.  Preserves the original format for auditing and interoperability purposes.  May differ from the primary discharge date time due to system variations.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "reason_for_visit_text",
    "type": "STRING",
    "description": "Free-text description of the reason for the encounter.  Provides additional context not captured in coded fields.  Useful for understanding the patient's perspective and the clinical context of the visit.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "mt_reason_for_visit_code",
    "type": "STRING",
    "description": "Coded representation of the reason for visit using a controlled vocabulary. Enables standardized reporting and analysis of encounter reasons.  Facilitates interoperability and data aggregation.",
    "PHI/PII": true,
    "HIPAA": true
  },
  {
    "name": "patient_location",
    "type": "RECORD",
    "mode": "REPEATED",
    "description": "Information about the patient's location during the encounter. Can include multiple locations if the patient moved during the encounter.  Useful for tracking patient flow and resource utilization.",
    "PHI/PII": true,
    "HIPAA": true,
    "fields": [
      {
        "name": "location_id",
        "type": "STRING",
        "description": "Unique identifier for the location.  Allows for precise identification and linking to location-specific information.",
        "PHI/PII": false,
        "HIPAA": false
      },
      {
        "name": "mnemonic",
        "type": "STRING",
        "description": "Short, memorable code or abbreviation for the location.  Facilitates quick reference and communication about the location.",
        "PHI/PII": false,
        "HIPAA": false
      },
      {
        "name": "physical_type",
        "type": "STRING",
        "description": "Categorization of the location's physical type (e.g., room, ward, department).  Supports analysis of location utilization patterns and resource allocation.",
        "PHI/PII": false,
        "HIPAA": false
      }
    ]
  },
  {
    "name": "emergency_department",
    "type": "RECORD",
    "description": "Specific information related to emergency department encounters. Captures key timestamps and details relevant to emergency care.",
    "PHI/PII": true,
    "HIPAA": true,
    "fields": [
      {
        "name": "edm_arrived_date_time",
        "type": "STRING",
        "description": "Date and time the patient arrived at the emergency department.  A crucial data point for tracking patient flow and wait times.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "edm_triaged_date_time",
        "type": "STRING",
        "description": "Date and time the patient was triaged in the emergency department.  Important for assessing triage efficiency and time to treatment.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "edm_departure_date_time",
        "type": "STRING",
        "description": "Date and time the patient departed from the emergency department. Marks the end of the ED encounter.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "coid",
        "type": "STRING",
        "description": "Check-out ID or other identifier related to the ED departure process.  May be used for internal tracking and reconciliation.",
        "PHI/PII": false,
        "HIPAA": false
      },
      {
        "name": "priority_rank",
        "type": "STRING",
        "description": "Numerical rank indicating the patient's priority level (e.g., 1, 2, 3).  Used for prioritizing patient care based on urgency.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "priority_code",
        "type": "STRING",
        "description": "Coded representation of the patient's priority using a standardized vocabulary.  Facilitates consistent interpretation of priority levels.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "priority_text",
        "type": "STRING",
        "description": "Textual description of the patient's priority level.  Provides additional context and clarity regarding the assigned priority.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "edm_reason_for_visit_code",
        "type": "STRING",
        "description": "Coded reason for visit specific to the emergency department context.  Allows for detailed analysis of ED visit reasons.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "edm_reason_for_visit_text",
        "type": "STRING",
        "description": "Free-text description of the reason for the ED visit.  Provides supplemental information not captured in coded fields.",
        "PHI/PII": true,
        "HIPAA": true
      },
      {
        "name": "departure_info",
        "type": "RECORD",
        "description": "Information related to the patient's departure from the ED.",
        "PHI/PII": true,
        "HIPAA": true,
        "fields": [
          {
            "name": "departure_disposition_code",
            "type": "STRING",
            "description": "Coded representation of the patient's disposition upon departure (e.g., admitted, discharged, transferred).",
            "PHI/PII": true,
            "HIPAA": true
          },
          {
            "name": "departure_disposition_text",
            "type": "STRING",
            "description": "Textual description of the patient's departure disposition.  Provides additional context about the discharge outcome.",
            "PHI/PII": true,
            "HIPAA": true
          },
          {
            "name": "departure_disposition_display",
            "type": "STRING",
            "description": "Human-readable display value for the departure disposition.  Improves usability and understanding of the disposition code.",
            "PHI/PII": true,
            "HIPAA": true
          },
          {
            "name": "departure_condition_code",
            "type": "STRING",
            "description": "Coded representation of the patient's condition upon departure (e.g., stable, critical).",
            "PHI/PII": true,
            "HIPAA": true
          },
          {
            "name": "departure_condition_text",
            "type": "STRING",
            "description": "Textual description of the patient's condition upon departure.  Provides further details about the patient's health status.",
            "PHI/PII": true,
            "HIPAA": true
          },
          {
            "name": "departure_condition_display",
            "type": "STRING",
            "description": "Human-readable display value for the departure condition.  Enhances clarity and understanding of the condition code.",
            "PHI/PII": true,
            "HIPAA": true
          },
          {
            "name": "departure_comments",
            "type": "STRING",
            "description": "Additional comments related to the patient's departure from the ED.  May include relevant clinical or logistical information.",
            "PHI/PII": true,
            "HIPAA": true
          }
        ]
      },
      {
        "name": "patient_location",
        "type": "RECORD",
        "description": "Information about the patient's location within the emergency department.",
        "PHI/PII": false,
        "HIPAA": false,
        "fields": [
          {
            "name": "treatment_room",
            "type": "RECORD",
            "description": "Details about the treatment room where the patient was located.",
            "PHI/PII": false,
            "HIPAA": false,
            "fields": [
              {
                "name": "room_code",
                "type": "STRING",
                "description": "Code identifying the treatment room.",
                "PHI/PII": false,
                "HIPAA": false
              },
              {
                "name": "room_text",
                "type": "STRING",
                "description": "Textual description or name of the treatment room.",
                "PHI/PII": false,
                "HIPAA": false
              }
            ]
          },
          {
            "name": "edm_location",
            "type": "RECORD",
            "description": "Details about a specific location within the ED.",
            "PHI/PII": false,
            "HIPAA": false,
            "fields": [
              {
                "name": "location_code",
                "type": "STRING",
                "description": "Code identifying the ED location.",
                "PHI/PII": false,
                "HIPAA": false
              },
              {
                "name": "location_text",
                "type": "STRING",
                "description": "Textual description or name of the ED location.",
                "PHI/PII": false,
                "HIPAA": false
              }
            ]
          },
          {
            "name": "reserved_room",
            "type": "RECORD",
            "description": "Details about a reserved room within the ED.",
            "PHI/PII": false,
            "HIPAA": false,
            "fields": [
              {
                "name": "room_code",
                "type": "STRING",
                "description": "Code identifying the reserved room.",
                "PHI/PII": false,
                "HIPAA": false
              },
              {
                "name": "room_text",
                "type": "STRING",
                "description": "Textual description or name of the reserved room.",
                "PHI/PII": false,
                "HIPAA": false
              }
            ]
          }
        ]
      },
      {
        "name": "edm_transport",
        "type": "RECORD",
        "description": "Information about the transport used for the patient in the ED context.",
        "PHI/PII": false,
        "HIPAA": false,
        "fields": [
          {
            "name": "transport_company_code",
            "type": "STRING",
            "description": "Code identifying the transport company.",
            "PHI/PII": false,
            "HIPAA": false
          },
          {
            "name": "transport_company_display",
            "type": "STRING",
            "description": "Human-readable name of the transport company.",
            "PHI/PII": false,
            "HIPAA": false
          },
          {
            "name": "transport_id_code",
            "type": "STRING",
            "description": "Code identifying the specific transport vehicle or instance.",
            "PHI/PII": false,
            "HIPAA": false
          },
          {
            "name": "transport_id_display",
            "type": "STRING",
            "description": "Human-readable identifier for the transport vehicle or instance.",
            "PHI/PII": false,
            "HIPAA": false
          },
          {
            "name": "transport_call_date_time",
            "type": "STRING",
            "description": "Date and time the transport was called or dispatched.",
            "PHI/PII": false,
            "HIPAA": false
          }
        ]
      }
    ]
  },
  {
    "name": "registration_query",
    "type": "RECORD",
    "mode": "REPEATED",
    "description": "Questions and responses collected during patient registration.  Captures important information for administrative and clinical purposes.",
    "PHI/PII": true,
    "HIPAA": true,
    "fields": [
      {
        "name": "mnemonic",
        "type": "STRING",
        "description": "Mnemonic or code for the registration question.",
        "PHI/PII": false,
        "HIPAA": false
      },
      {
        "name": "question",
        "type": "STRING",
        "description": "The text of the registration question.",
        "PHI/PII": false,
        "HIPAA": false
      },
      {
        "name": "response",
        "type": "STRING",
        "description": "The patient's response to the registration question.",
        "PHI/PII": true,
        "HIPAA": true
      }
    ]
  },
  {
    "name": "insert_timestamp",
    "type": "TIMESTAMP",
    "description": "Timestamp indicating when the encounter record was inserted into the system.  Useful for data provenance and tracking record creation time.",
    "PHI/PII": false,
    "HIPAA": false
  }
]